In [2]:
import pandas as pd
import numpy as np
import tabulate as tab

dataset = pd.read_csv('titanic.csv')
dataset

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [3]:
test_dataset = pd.read_csv('titanic_test.csv')
test_dataset["Sex"] = test_dataset["Sex"].astype('category').cat.codes
test_dataset

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",1,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",0,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",1,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",1,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",1,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",0,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",1,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",1,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",1,NaN,1,1,2668,22.3583,NaN,C

In [4]:
train_data = dataset[["Sex","Age","Pclass","Fare"]]
train_data["Age"].fillna(
    dataset.groupby(["Survived"])["Age"].transform("mean"),
    inplace=True
)
train_data["Sex"] = train_data["Sex"].astype('category').cat.codes
train_data

     Sex        Age  Pclass     Fare
0      1  22.000000       3   7.2500
1      0  38.000000       1  71.2833
2      0  26.000000       3   7.9250
3      0  35.000000       1  53.1000
4      1  35.000000       3   8.0500
..   ...        ...     ...      ...
886    1  27.000000       2  13.0000
887    0  19.000000       1  30.0000
888    0  30.626179       3  23.4500
889    1  26.000000       1  30.0000
890    1  32.000000       3   7.7500

[891 rows x 4 columns]

In [5]:
train_label = dataset[["Survived"]]
train_label

     Survived
0           0
1           1
2           1
3           1
4           0
..        ...
886         0
887         1
888         0
889         1
890         0

[891 rows x 1 columns]

In [6]:
import numbers
test_data = test_dataset[["Sex","Age","Pclass","Fare"]]
deletedIdx = []
for i in range(0, len(test_data)):
    if test_data["Age"][i] >= 0 and test_data["Fare"][i] >= 0:
        pass
    else:
        deletedIdx.append(i)
test_data = test_data.dropna(subset=['Age',"Fare"])
test_data

     Sex   Age  Pclass      Fare
0      1  34.5       3    7.8292
1      0  47.0       3    7.0000
2      1  62.0       2    9.6875
3      1  27.0       3    8.6625
4      0  22.0       3   12.2875
..   ...   ...     ...       ...
409    0   3.0       3   13.7750
411    0  37.0       1   90.0000
412    0  28.0       3    7.7750
414    0  39.0       1  108.9000
415    1  38.5       3    7.2500

[331 rows x 4 columns]

In [7]:
test_label = pd.read_csv('titanic_testlabel.csv')["Survived"]
test_label = test_label.drop(deletedIdx)
test_label

0      0
1      1
2      0
3      0
4      1
      ..
409    1
411    1
412    1
414    1
415    0
Name: Survived, Length: 331, dtype: int64

In [8]:
print("Sebelum Normalisasi")
print(
    tab.tabulate([
        ['Age', train_data["Age"].min(), train_data["Age"].max()],
        ['Fare', train_data["Fare"].min(), train_data["Fare"].max()],
        ['Sex', train_data["Sex"].min(), train_data["Sex"].max()],
        ['Pclass', train_data["Pclass"].min(), train_data["Pclass"].max()]
    ], headers=['Data','Min','Max'], tablefmt='fancy_grid')
)
print()
# ====================================================================

Sebelum Normalisasi
╒════════╤═══════╤═════════╕
│ Data   │   Min │     Max │
╞════════╪═══════╪═════════╡
│ Age    │  0.42 │  80     │
├────────┼───────┼─────────┤
│ Fare   │  0    │ 512.329 │
├────────┼───────┼─────────┤
│ Sex    │  0    │   1     │
├────────┼───────┼─────────┤
│ Pclass │  1    │   3     │
╘════════╧═══════╧═════════╛

In [9]:
minVal = 0
maxVal = 1

train_data = train_data - train_data.min() * (maxVal-minVal) / (train_data.max()-train_data.min()) + minVal

minAge = train_data["Age"].min()
maxAge = train_data["Age"].max()
minFare = train_data["Fare"].min()
maxFare = train_data["Fare"].max()
minSex = train_data["Sex"].min()
maxSex = train_data["Sex"].max()
minPclass = train_data["Pclass"].min()
maxPclass = train_data["Pclass"].max()

print("Sesudah Normalisasi")
print(
    tab.tabulate([
        ['Age', minAge, maxAge],
        ['Fare', minFare, maxFare],
        ['Sex', minSex, maxSex],
        ['Pclass', minPclass, maxPclass],
    ], headers=['Data','Min','Max'], tablefmt='fancy_grid')
)

Sesudah Normalisasi
╒════════╤══════════╤══════════╕
│ Data   │      Min │      Max │
╞════════╪══════════╪══════════╡
│ Age    │ 0.414722 │  79.9947 │
├────────┼──────────┼──────────┤
│ Fare   │ 0        │ 512.329  │
├────────┼──────────┼──────────┤
│ Sex    │ 0        │   1      │
├────────┼──────────┼──────────┤
│ Pclass │ 0.5      │   2.5    │
╘════════╧══════════╧══════════╛

In [10]:
test_data["Age"] = (
    test_data["Age"] -
    test_data["Age"].min() * (maxAge-minAge) /
    (test_data["Age"].max()-test_data["Age"].min()) + minAge
)

test_data["Fare"] = (
    test_data["Fare"] -
    test_data["Fare"].min() * (maxFare-minFare) /
    (test_data["Fare"].max()-test_data["Fare"].min()) + minFare
)

test_data["Sex"] = (
    test_data["Sex"] -
    test_data["Sex"].min() * (maxSex-minSex) /
    (test_data["Sex"].max()-test_data["Sex"].min()) + minSex
)

test_data["Pclass"] = (
    test_data["Pclass"] -
    test_data["Pclass"].min() * (maxPclass-minPclass) /
    (test_data["Pclass"].max()-test_data["Pclass"].min()) + minPclass
)

print(
    tab.tabulate([
        ['Age', str(test_data["Age"].min()), str(test_data["Age"].max())],
        ['Fare', str(test_data["Fare"].min()), str(test_data["Fare"].max())],
        ['Sex', str(test_data["Sex"].min()), str(test_data["Sex"].max())],
        ['Pclass', str(test_data["Pclass"].min()), str(test_data["Pclass"].max())]
    ], headers=['Data','Min','Max'], tablefmt='fancy_grid')
)

╒════════╤══════════╤══════════╕
│ Data   │      Min │      Max │
╞════════╪══════════╪══════════╡
│ Age    │ 0.406315 │  76.2363 │
├────────┼──────────┼──────────┤
│ Fare   │ 0        │ 512.329  │
├────────┼──────────┼──────────┤
│ Sex    │ 0        │   1      │
├────────┼──────────┼──────────┤
│ Pclass │ 0.5      │   2.5    │
╘════════╧══════════╧══════════╛

In [11]:
from sklearn.neighbors import KNeighborsClassifier
from sklearn.metrics import classification_report, accuracy_score

error_result = []
N = 10

for k in range(1, N+1):
    classifier = KNeighborsClassifier(n_neighbors=k)
    classifier.fit(train_data, train_label)
    ypred = classifier.predict(test_data)
    accuracy = accuracy_score(test_label, ypred)
    error = 1 - accuracy
    error_result.append(error)

    print(str(k) + "-NN")
    print("Error ratio : " + str(error))
    print(classification_report(test_label, ypred), end="")
    print("=====================================================")

1-NN
Error ratio : 0.41389728096676737
              precision    recall  f1-score   support

           0       0.69      0.60      0.64       204
           1       0.47      0.56      0.51       127

    accuracy                           0.59       331
   macro avg       0.58      0.58      0.58       331
weighted avg       0.60      0.59      0.59       331
=====================================================
2-NN
Error ratio : 0.3413897280966768
              precision    recall  f1-score   support

           0       0.68      0.84      0.75       204
           1       0.59      0.37      0.45       127

    accuracy                           0.66       331
   macro avg       0.63      0.60      0.60       331
weighted avg       0.65      0.66      0.64       331
=====================================================
3-NN
Error ratio : 0.35649546827794565
              precision    recall  f1-score   support

           0       0.71      0.70      0.71       204
           1       0.53      0.55      0.54       127

    accuracy                           0.64       331
   macro avg       0.62      0.63      0.63       331
weighted avg       0.65      0.64      0.64       331
=====================================================
4-NN
Error ratio : 0.3534743202416919
              precision    recall  f1-score   support

           0       0.69      0.79      0.73       204
           1       0.55      0.42      0.48       127

    accuracy                           0.65       331
   macro avg       0.62      0.60      0.60       331
weighted avg       0.63      0.65      0.63       331
=====================================================
5-NN
Error ratio : 0.36253776435045315
              precision    recall  f1-score   support

           0       0.71      0.69      0.70       204
           1       0.53      0.55      0.54       127

    accuracy                           0.64       331
   macro avg       0.62      0.62      0.62       331
weighted avg       0.64      0.64      0.64       331
=====================================================
6-NN
Error ratio : 0.3534743202416919
              precision    recall  f1-score   support

           0       0.70      0.76      0.73       204
           1       0.55      0.46      0.50       127

    accuracy                           0.65       331
   macro avg       0.62      0.61      0.61       331
weighted avg       0.64      0.65      0.64       331
=====================================================
7-NN
Error ratio : 0.36253776435045315
              precision    recall  f1-score   support

           0       0.71      0.70      0.70       204
           1       0.53      0.54      0.53       127

    accuracy                           0.64       331
   macro avg       0.62      0.62      0.62       331
weighted avg       0.64      0.64      0.64       331
=====================================================
8-NN
Error ratio : 0.36253776435045315
              precision    recall  f1-score   support

           0       0.69      0.74      0.71       204
           1       0.53      0.48      0.50       127

    accuracy                           0.64       331
   macro avg       0.61      0.61      0.61       331
weighted avg       0.63      0.64      0.63       331
=====================================================
9-NN
Error ratio : 0.3655589123867069
              precision    recall  f1-score   support

           0       0.70      0.71      0.70       204
           1       0.52      0.52      0.52       127

    accuracy                           0.63       331
   macro avg       0.61      0.61      0.61       331
weighted avg       0.63      0.63      0.63       331
=====================================================
10-NN
Error ratio : 0.3474320241691843
              precision    recall  f1-score   support

           0       0.70      0.77      0.73       204
           1       0.56      0.46      0.51       127

    accuracy                           0.65       331
   macro avg       0.63      0.62      0.62       331
weighted avg       0.64      0.65      0.65       331
=====================================================

In [14]:
train_label

     Survived
0           0
1           1
2           1
3           1
4           0
..        ...
886         0
887         1
888         0
889         1
890         0

[891 rows x 1 columns]